In [345]:
import pandas as pd

In [346]:
df = pd.read_csv('kc_house_data.csv')

In [347]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,...,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,0.0,0.0,...,7,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,0.0,0.0,...,6,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,...,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,...,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

In [348]:
df.isna().sum()

id                  0
date                0
price               0
bedrooms            0
bathrooms           0
sqft_living         0
sqft_lot            0
floors              0
waterfront       2376
view               63
condition           0
grade               0
sqft_above          0
sqft_basement       0
yr_built            0
yr_renovated     3842
zipcode             0
lat                 0
long                0
sqft_living15       0
sqft_lot15          0
dtype: int64

Looking at the null values, we can see that the columns waterfont, view and yr_renovated all have missing values. We will investigate each column in more detail

In [349]:
df['waterfront'].unique()

array([nan,  0.,  1.])

The waterfront column is a binary value, 0 representing not waterfront property, 1 representing waterfront property. We have assumed that the null values are not waterfront properties and will change the null values to 0

In [350]:
df["waterfront"] = df["waterfront"].fillna(0.0)

Looking into the definition of view, we see that this is the number of times a property was viewed. We do not see this relevant to our house price prediction model, we will remove this column from our dataset entirely.

In [351]:
df.drop(columns='view', inplace=True)

In [352]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')

Looking at yr_renovated, it looks like there are quite a few nan values here. We have assumed that this means the property was never renovated. We have decided to replace these nan values with the year the proeprty was built.

In [353]:
df["yr_renovated"].unique()

array([   0., 1991.,   nan, 2002., 2010., 1992., 2013., 1994., 1978.,
       2005., 2003., 1984., 1954., 2014., 2011., 1983., 1945., 1990.,
       1988., 1977., 1981., 1995., 2000., 1999., 1998., 1970., 1989.,
       2004., 1986., 2007., 1987., 2006., 1985., 2001., 1980., 1971.,
       1979., 1997., 1950., 1969., 1948., 2009., 2015., 1974., 2008.,
       1968., 2012., 1963., 1951., 1962., 1953., 1993., 1996., 1955.,
       1982., 1956., 1940., 1976., 1946., 1975., 1964., 1973., 1957.,
       1959., 1960., 1967., 1965., 1934., 1972., 1944., 1958.])

In [354]:
df["yr_renovated"] = df["yr_renovated"].fillna(df["yr_built"])

In [355]:
#checking to see if this worked.
df["yr_renovated"].isna().sum()

0

In [356]:
df['bedrooms'].unique()

array([ 3,  2,  4,  5,  1,  6,  7,  8,  9, 11, 10, 33])

We can see that one of the properties has 33 bedrooms, this looks incorrect, we will drop the entire row.

In [357]:
df = df[df['bedrooms']!=33]

In [358]:
#checking to see if this was removed.
df['bedrooms'].unique()

array([ 3,  2,  4,  5,  1,  6,  7,  8,  9, 11, 10])

We can see that sqft_basements has a variable "?". We can see that there are 454 entries with "?". We are assuming that these properties do not have any basement, We will fill these as 0.

In [359]:
df['sqft_basement'].value_counts()

0.0       12826
?           454
600.0       217
500.0       209
700.0       208
          ...
1770.0        1
1816.0        1
2400.0        1
374.0         1
2390.0        1
Name: sqft_basement, Length: 304, dtype: int64

In [360]:
df["sqft_basement"].replace(to_replace ="?", 
                 value = "0.0", inplace=True)

In [361]:
df['sqft_basement'].value_counts()

0.0       13280
600.0       217
500.0       209
700.0       208
800.0       201
          ...
1816.0        1
666.0         1
2400.0        1
1770.0        1
2390.0        1
Name: sqft_basement, Length: 303, dtype: int64